app/controllers/articles_controller.rb

def create
@article = Article.new(article_params)
if @article.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "jjkjkjk"], ["text", "klklkl"], ["created_at", "2015-05-16 07:56:38.830532"], ["updated_at", "2015-05-16 07:56:38.830532"]]